In [23]:
import pandas
pandas.__version__

'0.20.3'

In [24]:
import numpy as np
import pandas as pd
data=pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [25]:
data=pd.Series([0.25,0.5,0.75,1.0])
data
data.values

array([ 0.25,  0.5 ,  0.75,  1.  ])

In [26]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [27]:
data[1]

0.5

In [28]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [29]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [30]:
data['b']

0.5

In [31]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=[2,5,3,7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [32]:
data[5]

0.5

In [33]:
population_dict={'California':38332521,
                'Texas':26448193,
                'New York': 19651127,
                'Florida': 19552860,
                'Illinois':12882135}
population = pd.Series(population_dict)
population

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [34]:
import numpy as np
import pandas as pd
population_dict={'California':38332521,
                'Texas':26448193,
                'New York': 19651127,
                'Florida': 19552860,
                'Illinois':12882135}
population = pd.Series(population_dict)
population['California']

38332521

In [35]:
population['California':'Illinois']

California    38332521
Florida       19552860
Illinois      12882135
dtype: int64

In [36]:
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

In [37]:
pd.Series(5, index=[100,200,300])

100    5
200    5
300    5
dtype: int64

In [38]:
pd.Series({2:'a',1:'b',3:'c'})

1    b
2    a
3    c
dtype: object

In [39]:
pd.Series({2:'a',1:'b',3:'c'}, index=[3,2])

3    c
2    a
dtype: object

In [40]:
area_dict = {'California':423967, 'Texas': 695662, 'New York': 141297,
            'Florida':170312, 'Illinois':149995}
area = pd.Series(area_dict)
area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
dtype: int64

In [41]:
states = pd.DataFrame({'population':population,'area':area})
states

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [42]:
states.index

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [43]:
states.columns

Index(['area', 'population'], dtype='object')

In [44]:
states['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [45]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193

In [46]:
pd.DataFrame([{'a':1,'b':2},{'b':3,'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [47]:
pd.DataFrame({'population':population,'area':area})

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [48]:
pd.DataFrame(np.random.rand(3,2),
            columns=['foo','bar'],
            index=['a','b','c'])

        foo       bar
a  0.659532  0.790088
b  0.456907  0.750074
c  0.522011  0.392225

In [49]:
A = np.zeros(3, dtype=[('A','i8'),('B','f8')])
A

array([(0,  0.), (0,  0.), (0,  0.)],
      dtype=[('A', '<i8'), ('B', '<f8')])

In [50]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [51]:
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [52]:
ind[1]

3

In [53]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [54]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [55]:
ind[1]=0

TypeError: Index does not support mutable operations

In [56]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

In [57]:
indA&indB #Intersection

Int64Index([3, 5, 7], dtype='int64')

In [58]:
indA|indB #Union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [59]:
indA^ind #Symmetric difference

Int64Index([1, 2, 9, 11], dtype='int64')

In [60]:
data = pd.Series([0.25,.5,0.75,1.0],
                index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [61]:
data['b']

0.5

In [62]:
'a' in data

True

In [63]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [64]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [65]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [66]:
#slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [67]:
#slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [68]:
#masking
data[(data>0.3)&(data<0.8)]

b    0.50
c    0.75
dtype: float64

In [69]:
#fancy indexing
data[['a','e']]

a    0.25
e    1.25
dtype: float64

In [70]:
data = pd.Series(['a','b','c'],
                index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [71]:
#explicit index when indexing
data[1]

'a'

In [72]:
#implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

In [73]:
#loc allows indexing and slicing that always references the explicit Index
data.loc[1]

'a'

In [74]:
data.loc[1:3]

1    a
3    b
dtype: object

In [75]:
#iloc allows indexing and slicing that references implicit index
data.iloc[1]

'b'

In [76]:
data.iloc[1:3]

3    b
5    c
dtype: object

In [77]:
area = pd.Series({'California': 423967, 'Texas': 695662,
'New York': 141297, 'Florida': 170312,
'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127, 'Florida': 19552860,
'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [78]:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [79]:
data.area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [80]:
data.area is data['area']

True

In [81]:
data.pop is data['pop']

False

In [82]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [83]:
data.values

array([[  4.23967000e+05,   3.83325210e+07,   9.04139261e+01],
       [  1.70312000e+05,   1.95528600e+07,   1.14806121e+02],
       [  1.49995000e+05,   1.28821350e+07,   8.58837628e+01],
       [  1.41297000e+05,   1.96511270e+07,   1.39076746e+02],
       [  6.95662000e+05,   2.64481930e+07,   3.80187404e+01]])

In [84]:
data.T

           California       Florida      Illinois      New York         Texas
area     4.239670e+05  1.703120e+05  1.499950e+05  1.412970e+05  6.956620e+05
pop      3.833252e+07  1.955286e+07  1.288214e+07  1.965113e+07  2.644819e+07
density  9.041393e+01  1.148061e+02  8.588376e+01  1.390767e+02  3.801874e+01

In [85]:
data.values[0]

array([  4.23967000e+05,   3.83325210e+07,   9.04139261e+01])

In [86]:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [87]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

In [88]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

In [89]:
data.ix[:3, :'pop']

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

In [90]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [91]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [92]:
#While indexing refers to columns, slicing refers to rows
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [93]:
data[1:3]

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [94]:
data[data.density >100]

            area       pop     density
Florida   170312  19552860  114.806121
New York  141297  19651127  139.076746

In [95]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [96]:
df = pd.DataFrame(rng.randint(0,10,(3,4)),
                 columns=['A','B','C','D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [97]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [98]:
np.sin(df*np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [99]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127}, name='population')

In [100]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [101]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [102]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [103]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [104]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [105]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [106]:
A+B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [107]:
import numpy as np
import pandas as pd
rng = np.random.RandomState(42)
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
columns=list('AB'))
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
columns=list('BAC'))
A+B
fill = A.stack().mean()
A.add(C, fill_value=fill)

NameError: name 'C' is not defined

In [108]:
import numpy as np
import pandas as pd
A = rng.randint(10, size=(3,4))
A

array([[7, 7, 2, 5],
       [4, 1, 7, 5],
       [1, 4, 0, 9]])

In [109]:
A-A[0]

array([[ 0,  0,  0,  0],
       [-3, -6,  5,  0],
       [-6, -3, -2,  4]])

In [110]:
df = pd.DataFrame(A, columns=list('QRST'))
df -df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -3 -6  5  0
2 -6 -3 -2  4

In [111]:
#Operate column-wise
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  0  0 -5 -2
1  3  0  6  4
2 -3  0 -4  5

In [112]:
#Note that DataFrame/Series operations will auto align indices between 2
#elements
halfrow = df.iloc[0,::2]
halfrow

Q    7
S    2
Name: 0, dtype: int64

In [113]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -3.0 NaN  5.0 NaN
2 -6.0 NaN -2.0 NaN

In [114]:
#This preservation and alignment of indices and columns means the operations
#on data in pd will always maintain the data context, which prevents the 
#types of silly errors that might come up when you're working w/ hetergeneous
#and/or misaligned data in raw np arrays

In [115]:
#Two schemes here to indicate the presence of missing data in DataFrame
#1) Using a mask that globally indicates missing values
#2) Choosing a sentinel value that indicates a missing entry.

In [116]:
#In masking, the mask might be an entirely separate Booklean array, or it
#may involve appropriation of one bit in the data representation to locally
#indicate the null status of a value

#TRADEOFFS: requires allocation of an addictional Boolean array, which adds
#overhead in both storage and compution.

In [117]:
#In sentinel, the sentinel value could be some data-specific convention,
#such as indicating a missing integer value with-9999 or some rare bit 
#pattern, pr it could be a more global convention, such as indicating a 
#missing floating-point value w/ NaN(Not a number), a special value which
#is part of the IEEE floating-point specification

#TRADEOFFS: reduces the range of valid values that can be represented, and
#may require extra(often non-optimized) logic in CPU and GPU arithmetic.
#Common special values like NaN are not available for all data types

In [118]:
import numpy as np
import pandas as pd
vals1 = np.array([1, None,3,4])
vals1

array([1, None, 3, 4], dtype=object)

In [119]:
for dtype in ['object','int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
52.1 ms  1.27 ms per loop (mean  std. dev. of 7 runs, 10 loops each)

dtype = int
828 s  10.1 s per loop (mean  std. dev. of 7 runs, 1000 loops each)

In [120]:
#The use of Python objects in an array means if you perform aggregations
#like sum() or min() across an array w/ a None value, you will get an error
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [ ]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

In [ ]:
#Regardless of the operation, the result of arithmetic with NaN will be NaN
1+ np.nan
0*np.nan

In [ ]:
vals2.sum(), vals2.min(), vals2.max()

In [ ]:
#Np provides some special aggregation that will ignore these missing values
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

In [ ]:
pd.Series([1, np.nan, 2, None])

In [ ]:
x = pd.Series(range(2), dtype=int)
x

In [ ]:
x[0]= None
x

In [ ]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

In [ ]:
data[data.notnull()]

In [ ]:
data.dropna()

In [ ]:
df = pd.DataFrame([[1, np.nan, 2],
[2, 3, 5],
[np.nan, 4, 6]])
df

In [ ]:
df.dropna()

In [ ]:
df.dropna(axis='columns')

In [ ]:
df[3]= np.nan
df

In [ ]:
df.dropna(axis='columns',how='all')

In [ ]:
#Here the first and last row have been dropped, bc they contain only two 
#non-null values
df.dropna(axis='rows', thresh=3)

In [ ]:
data = pd.Series([1,np.nan, 2, None, 3], index=list('abcde'))
data

In [ ]:
#We can fill NA entries with a single value, such as zero
data.fillna(0)

In [ ]:
#Can specify a forward-fill to propagate the previous value forward.
data.fillna(method='ffill')

In [121]:
#Can specify a back-fill to propage the next values backward:
data.fillna(method='bfill')

              area       pop     density
California  423967  38332521   90.000000
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [122]:
df.fillna(method='ffill', axis=1)

   Q  R  S  T
0  7  7  2  5
1  4  1  7  5
2  1  4  0  9

In [123]:
#A multiply indexed Series (THE BAD WAY)
index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
18976457, 19378102,
20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [124]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [125]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [126]:
#Pandas MultiIndex(THE BETTER WAY):
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [127]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [128]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [129]:
#MultiIndex as extra dimension
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [130]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [131]:
pop_df = pd.DataFrame({'total': pop,
'under18': [9267089, 9284094,
4687374, 4318033,
5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [132]:
f_u18 = pop_df['under18']/ pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [133]:
df = pd.DataFrame(np.random.rand(4, 2),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=['data1', 'data2'])
df

        data1     data2
a 1  0.405311  0.846270
  2  0.761170  0.020220
b 1  0.661981  0.023915
  2  0.877368  0.975980

In [134]:
data = {('California', 2000): 33871648,
('California', 2010): 37253956,
('Texas', 2000): 20851820,
('Texas', 2010): 25145561,
('New York', 2000): 18976457,
('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [135]:
#Explicit MultiIndex constructors
pd.MultiIndex.from_arrays([['a','b','b','b'],[1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 1, 1, 1], [0, 1, 0, 1]])

In [136]:
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [137]:
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [138]:
pd.MultiIndex(levels=[['a','b'],[1,2]],
             labels=[[0,0,1,1],[0,1,0,1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [139]:
#MultiIndex level names
pop.index.names = ['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [140]:
#MultiIndex for columns. Hierarchial indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      39.0  36.6  33.0  38.3  36.0  37.1
     2      48.0  35.0  44.0  37.7  35.0  38.4
2014 1      46.0  38.2  28.0  38.1  51.0  37.7
     2      40.0  35.2  34.0  36.2  46.0  35.9

In [141]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      33.0  38.3
     2      44.0  37.7
2014 1      28.0  38.1
     2      34.0  36.2

In [142]:
#Can access single elements by indexing with multiple terms:
pop['California', 2000]

33871648

In [143]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [144]:
#Partial slicing
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [145]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [146]:
pop[pop>22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [147]:
pop[['California','Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [148]:
health_data['Guido','HR']

year  visit
2013  1        33.0
      2        44.0
2014  1        28.0
      2        34.0
Name: (Guido, HR), dtype: float64

In [149]:
health_data.iloc[:2,:2]

subject      Bob
type          HR  Temp
year visit
2013 1      39.0  36.6
     2      48.0  35.0

In [150]:
import pandas as pd
import numpy as np
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
names=['subject', 'type'])
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data


health_data.loc[:,('Bob','HR')]

year  visit
2013  1        46.0
      2        33.0
2014  1        45.0
      2        53.0
Name: (Bob, HR), dtype: float64

In [151]:

idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      46.0  26.0  40.0
2014 1      45.0  43.0  38.0

In [152]:
#Rearraging Multi-Indices: There are many ways to finely control the 
#rearragement of data between hierarchial indices and columns.

#Sorted and unsorted indices (Start with indices are not lexographically)

index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1,2]])
data = pd.Series(np.random.rand(6), index = index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.602024
      2      0.698601
c     1      0.954793
      2      0.342923
b     1      0.364440
      2      0.089048
dtype: float64

In [153]:
#If we try to take a partial slice of this index, it will be an error:

try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)
    
#This is the result of the multiindex not being sorted.

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [154]:
#An example of sorting methods of the DataFrame

data = data.sort_index()
data

char  int
a     1      0.602024
      2      0.698601
b     1      0.364440
      2      0.089048
c     1      0.954793
      2      0.342923
dtype: float64

In [155]:
#With Index sorted in this way, partial slicing will work as expected
data['a':'b']

char  int
a     1      0.602024
      2      0.698601
b     1      0.364440
      2      0.089048
dtype: float64

In [156]:
#Stacking and unstacking indices. convert a dataset from a stacked multi-
#index to a simple 2D representation
#Error is a result of a change is sessions. CODE WILL WORK IN ! SESSION

data = {('California', 2000): 33871648,
('California', 2010): 37253956,
('Texas', 2000): 20851820,
('Texas', 2010): 25145561,
('New York', 2000): 18976457,
('New York', 2010): 19378102}
pd.Series(data)

index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
18976457, 19378102,
20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

pop.unstack(level=0)
pop.unstack(level=1)
pop.unstack().stack()

AttributeError: 'Index' object has no attribute 'labels'

In [157]:
#Index setting and resetting turning the index labels into columns
pop_flat = pop.reset_index(name='population')
pop_flat

pop_flat.set_index(['state','year'])

KeyError: 'state'

In [159]:
#Data Aggregation on Multi-Indices:

health_data
data_mean = health_data.mean(level='year')
data_mean
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  38.500000  36.633333
2014  40.833333  37.000000

In [161]:
#Combining Datasets: Concat and Append

import pandas as pd
import numpy as np

def make_df(cols, ind):
    #"""Quickly make a DataFrame""""
    data = {c: [str(c) + str(i) for i in ind]
           for c in cols}
    return pd.DataFrame(data, ind)

#example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [162]:
#Concatenation of NumPy Arrays
x = [1,2,3]
y = [4,5,6]
z = [7,8,9]
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [163]:
x = [[1,2],
    [3,4]]
np.concatenate([x,x], axis = 1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [171]:
#Simple concatenation w/ pd.concat
#pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False,
         #keys=None, levels=None, names=None, verify_integrity=False,
         #copy=True)

ser1 = pd.Series(['A','B','C'], index=[1,2,3])
ser2 = pd.Series(['D','E','F'], index=[4,5,6])
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [172]:
df1 = make_df('AB', [1,2])
df2 = make_df('AB', [3,4])
print(df1); print(df2); print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [173]:
df3 = make_df('AB', [0,1])
df4 = make_df('CD', [0,1])
print(df3); print(df4); print(pd.concat([df3,df4], axis='col'))

#DONT UNDERSTAND THIS ERROR

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1

ValueError: No axis named col for object type <class 'pandas.core.frame.DataFrame'>

In [176]:
#Duplicate indices: Pandas concatenation preserves indices
x = make_df('AB', [0,1])
y = make_df('AB', [2,3])
y.index = x.index #make duplicate indices!
print(x); print(y); print(pd.concat([x,y]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [177]:
#Catching the repeats as an error

try:
    pd.concat([x,y], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: [0, 1]

In [178]:
#Ignoring the index: w/ this set to True, concat will create a new integer
#index for the resulting series:

print(x); print(y); print(pd.concat([x,y], ignore_index=True))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [179]:
#Adding multiindex keys: keys option to specify a label for the data sources
#The result will be a hierarchially indexed series containing data:

print(x); print(y); print(pd.concat([x,y], keys=['x','y']))

#The result is a multiply indexed DataFrame

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [180]:
#Concat w/ joins: 
df5 = make_df('ABC', [1,2])
df6 = make_df('BCD', [3,4])
print(df5); print(df6); print(pd.concat([df5, df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [181]:
#By default, entries for which no data is available are filled w/ NA vals
#Change this by the following

print(df5); print(df6);
print(pd.concat([df5, df6], join='inner'))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [182]:
#Alternatively: pd.concat func allows a range of possible behaviors when
#joining two datasets
print(df5); print(df6);
print(pd.concat([df5, df6], join_axes=[df5.columns]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

In [ ]:
#The Append() method: Series and DataFrame objects have an append method
#that can accomplish the same thing in fewer keystrokes
print(df1); print(df2); print(df.append(df2))

#Append method in Pandas doesn't modify the original object--instead, it 
#creates a new object w/ the combined data. If you plan to do multiple
#append operations, it is generally better to build a list of DataFrames
#and pass them all at once to the concat function.

In [ ]:
#One essential feature in Pandas is its high-performance, in-memory join
# and merge operations. The main interface for this is the pd.merge func
#Pandas implements several fundamental building blocks in the merge func
#and the related join method of series and dataframes.

#pd.merge() implements a number of types of joins: the 1-to-1, many-to-1,
#many-to-many joins. All 3 types of joins are accessed via pd.merge()

In [183]:
#1-to-1 joins:

df1 = pd.DataFrame({'employee':['Bob', 'Jake', 'Lisa,', 'Sue'],
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee':['Lisa','Bob','Jake','Sue'],
                   'hire_date':[2004,2008,2012,2014]})
print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2    Lisa,  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [184]:
#To combine this info into a single DF, we use pd.merge() function:
df3 = pd.merge(df1, df2)
df3

#The merge in general discards the index, except in the special case of 
#merges by index

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2      Sue           HR       2014

In [186]:
#Many-to-one Joins: the resulting DF has an additional column w/ the 'supervisor'
#info, where the info is repeated in 1 or more locations as required by inputs

df4 = pd.DataFrame({'group':['Accounting','Engineering','HR'],
                   'supervisor':['Carly','Guido','Steve']})
print(df3); print(df4); print(pd.merge(df3,df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2      Sue           HR       2014      Steve

In [188]:
#Many-to-many joins: joins can be used w/ other pd tools to implement a wide
#array of functionality
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                                         'Engineering', 'Engineering', 'HR', 'HR'],
                     'skills': ['math', 'spreadsheets', 'coding', 'linux',
                                      'spreadsheets', 'organization']})
print(df1); print(df5); print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2    Lisa,  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4    Lisa,  Engineering        coding
5    Lisa,  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [189]:
#explicityly specify the name of the key column using the on keyword, which
#takes a column name or a list of colmn names. ONLY works if both the left
#and right DF have the specified colmn name:

print(df1); print(df2); print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2    Lisa,  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2      Sue           HR       2014

In [190]:
#The left_on & right_on keywords. merge 2 datasets w/ different column names
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3);print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2    Lisa,  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2      Sue           HR   Sue   90000

In [191]:
#The result has redundant column that can be dropped as follows:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2      Sue           HR   90000

In [192]:
#The left_index & right_index keywords. Instead of column, merge on an index
df1a = df1.set_index('employee') 
df2a = df2.set_index('employee') 
print(df1a); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa,     Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [193]:
#Can use index as key for merging by specifying the left_index and/or 
#right_index flags in pd.merge():
print(df1a); print(df2a);
print(pd.merge(df1a, df2a, left_index=True, right_index=True))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa,     Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Sue                HR       2014

In [194]:
#DF implement the join() method, performing a merge that defaults to joining
#on indices:
print(df1a); print(df2a); print(df1a.join(df2a))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa,     Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting     2008.0
Jake      Engineering     2012.0
Lisa,     Engineering        NaN
Sue                HR     2014.0

In [195]:
#Mix indices&columns, can combine left_index w/ right_on or left_on w/ 
#right_index to get the desired behavior:
print(df1a); print(df3);
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa,     Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
3           HR   Sue   90000

In [196]:
#Previous examples did not consider 1 important consideration in performing
#a join: the type of set arithmetic used in the join. This comes up when a 
#value appears in 1 key column but not the other. Consider this:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                     columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                    columns=['name', 'drink']) 
print(df6); print(df7); print(pd.merge(df6, df7))


#Here, the result contains the intersection of the 2 sets of inputs(inner join)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [197]:
#Specifying this explicitly using the how keyword, which defaults to 'inner'
pd.merge(df6, df7, how='inner')

#Other options for the how keyword are: 'outer', 'left', and 'right'k

   name   food drink
0  Mary  bread  wine

In [198]:
#Outer join returns a join over the union of the input columns, and filling
#in all missing values w/ NA's:
print(df6); print(df7); print(pd.merge(df6, df7, how='outer'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [199]:
#Left join, right join return join over the left and right entries:
print(df6); print(df7); print(pd.merge(df6, df7, how='left'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [200]:
#OVERLAPPING COLUMN NAMES: THE SUFFIXES KEYWORD. Conflicting column names
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
print(df8); print(df9); print(pd.merge(df8, df9, on="name"))


#Since output would have 2 conflicting column names, merge automatically
#appends a suffix_x or _y to make output columns unique.

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [201]:
print(df8); print(df9);
print(pd.merge(df8, df9, on="name", suffixes=["_L", "_R"]))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [206]:
#EXAMPLE: US STATE DATA:
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 57935  100 57935    0     0  57935      0  0:00:01 --:--:--  0:00:01  514k
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   835  100   835    0     0    835      0  0:00:01 --:--:--  0:00:01 12101
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   872  100   872    0     0    872      0  0:00:01 --:--:--  0:00:01 12823

In [207]:
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')
print(pop.head()); print(areas.head()); print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [208]:
#Goal: rank US states and territories by their 2010 pop density by combining
#DFs. Want to merge based on the state/region column of pop. Use how='outer'
#to make sure no data is thrown away due to mismatched labels.

merged = pd.merge(pop, abbrevs, how='outer',
                 left_on='state/region', right_on='abbreviation')
merged = merged.drop('abbreviation', 1)
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [209]:
#Double-check there were any mismatches, can do by looking for rows w/ nulls
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [210]:
#Find out which population information is null!
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [213]:
#NOTE: all null pop values are from PR prior to the 2000. ALso, some of the
#new state entries are null, meaning there was no corresponding entry in 
#the abbrevs key:

merged.loc[merged['state'].isnull(), 'state/region'].unique

<bound method Series.unique of 2448     PR
2449     PR
2450     PR
2451     PR
2452     PR
2453     PR
2454     PR
2455     PR
2456     PR
2457     PR
2458     PR
2459     PR
2460     PR
2461     PR
2462     PR
2463     PR
2464     PR
2465     PR
2466     PR
2467     PR
2468     PR
2469     PR
2470     PR
2471     PR
2472     PR
2473     PR
2474     PR
2475     PR
2476     PR
2477     PR
       ...
2514    USA
2515    USA
2516    USA
2517    USA
2518    USA
2519    USA
2520    USA
2521    USA
2522    USA
2523    USA
2524    USA
2525    USA
2526    USA
2527    USA
2528    USA
2529    USA
2530    USA
2531    USA
2532    USA
2533    USA
2534    USA
2535    USA
2536    USA
2537    USA
2538    USA
2539    USA
2540    USA
2541    USA
2542    USA
2543    USA
Name: state/region, Length: 96, dtype: object>

In [214]:
#Population data includes PR and USA as a whole, while these entries dont 
#appear in the state abbreviation key. Quick fix is as follows:

merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [215]:
#Now, merge the result w/ the area data using similar process.
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [216]:
#Check mnulls to see if any mismatches occured...

final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [217]:
#Nulls present in area and pop.... investigate....
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [218]:
#Need to insert the total area of the US as follows....
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [220]:
#Now we can approach the inital question of pop density.... Lets GO!!!!
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [221]:
#Indexing our data on the state, and then computing the result
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']

In [223]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [224]:
#The result is the top population density, in residents per sq mile.
#For heck sakes, lets look at the tail of the DF
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

In [ ]:
###AGGREGATION AND GROUPING:::::::

In [225]:
#Planets Data
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [226]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [227]:
#Simple aggregation in Pds:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [228]:
ser.sum()

2.811925491708157

In [229]:
ser.mean()

0.5623850983416314

In [231]:
#For a DF, defaults the aggregate returns results within each column
df = pd.DataFrame({'A': rng.rand(5),
                  'B': rng.rand(5)})
df

          A         B
0  0.020584  0.183405
1  0.969910  0.304242
2  0.832443  0.524756
3  0.212339  0.431945
4  0.181825  0.291229

In [232]:
df.mean()

A    0.443420
B    0.347115
dtype: float64

In [233]:
#When specifying the axis argument, can aggregate within each row:
df.mean(axis='columns')

0    0.101995
1    0.637076
2    0.678600
3    0.322142
4    0.236527
dtype: float64

In [234]:
#A simple statistical analysis is achieved with the describe function
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [235]:
#GROUPBY: SPLIT, APPLY COMBINE: A canonical ex. of this split, apply,
#combine operation. 

#The split step involves breaking up and grouping a DF depending on 
#the value of the specified key.

#The apply step involves computing some function, usually an aggregate
#transformation, or filtering, within the individual groups.

#The combine step merges the results of these operations into an 
#output array

In [236]:
#Groupby: exampled

df = pd.DataFrame({'key':['A','B','C','A','B','C'],
                  'data': range(6)}, columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [237]:
#Most basic split-spply-combine opperation w/ groupby() method of DFs

df.groupby('key')

#NOTE: returned value is nota set of DFs but a DFGroupBy object.
#This object is IMPORTANT! poised to dig into the groups but does no
#computation until the agg is applied. This means that common agg
#can be implemented efficiently in a way that is essentially invisible
#to user.

In [238]:
#Results can be produced by the following....
df.groupby('key').sum()

#You can replace essentially any valid DF op in place of .sum()

     data
key
A       3
B       5
C       7

In [239]:
#Groupby object is flexible. Treat it as if it's a collection of Dfs
#The most important operations by a Groupby are aggregate, filter, 
#transform, and apply. 

#Column indexing: GroupBy(GB) supports column indexting, returns object

planets.groupby('method')

In [240]:
planets.groupby('method')['orbital_period']

In [241]:
#Selected particular Series group from original DF by reference to its
#No comp done until call to some aggregate on the object is made

planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [242]:
#Iteration over groups: returning each group as a Series or DF:

for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [243]:
#Dispatch method: any method not explicitly implemented by the GB obj
#will pass thru and called on the groups, whether DF or Series obj.

planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.000000
       Eclipse Timing Variations           9.000000
       Imaging                            38.000000
       Microlensing                       23.000000
       Orbital Brightness Modulation       3.000000
       Pulsar Timing                       5.000000
       Pulsation Timing Variations         1.000000
       Radial Velocity                   553.000000
       Transit                           397.000000
       Transit Timing Variations           4.000000
mean   Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.131579
       Microlensing                     2009.782609
       Orbital Brightness Modulation    2011.666667
       Pulsar Timing                    1998.400000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2007.518987
       Transit                          2011.236776
       Transit Timing Variations        2012.500000
std    Astrometry                          2.121320
       Eclipse Timing Variations           1.414214
       Imaging                             2.781901
       Microlensing                        2.859697
       Orbital Brightness Modulation       1.154701
       Pulsar Timing                       8.384510
       Pulsation Timing Variations              NaN
       Radial Velocity                     4.249052
       Transit                             2.077867
       Transit Timing Variations           1.290994
                                           ...
50%    Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.000000
       Microlensing                     2010.000000
       Orbital Brightness Modulation    2011.000000
       Pulsar Timing                    1994.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2009.000000
       Transit                          2012.000000
       Transit Timing Variations        2012.500000
75%    Astrometry                       2012.250000
       Eclipse Timing Variations        2011.000000
       Imaging                          2011.000000
       Microlensing                     2012.000000
       Orbital Brightness Modulation    2012.000000
       Pulsar Timing                    2003.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2011.000000
       Transit                          2013.000000
       Transit Timing Variations        2013.250000
max    Astrometry                       2013.000000
       Eclipse Timing Variations        2012.000000
       Imaging                          2013.000000
       Microlensing                     2013.000000
       Orbital Brightness Modulation    2013.000000
       Pulsar Timing                    2011.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2014.000000
       Transit                          2014.000000
       Transit Timing Variations        2014.000000
Length: 80, dtype: float64

In [ ]:
Left on page 166